Show / Hide Table of Contents
Class CssComponent
One component of cross-section
Inheritance
System.Object
OpenObject
CssComponent
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.CssComponent,CI.CrossSection")]
public class CssComponent : OpenObject
Properties
Improve this Doc   View Source
Geometry
Geometry
Declaration
public Region2D Geometry { get; set; }
Property Value
 Type |  Description
 Region2D
Improve this Doc   View Source
Id
Component Id
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Material
Material
Declaration
public ReferenceElement Material { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Phase
Phase
Declaration
public int Phase { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source